# Books Core Exercise
- Priscilla E. Cole
- November 13, 2022

![png](data/BooksERD.png)

In [1]:
# import libraries
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
# add for special characters
from urllib.parse import quote_plus as urlquote
from sqlalchemy.engine import create_engine

In [3]:
username = 'root'
password = 'Elise1996!'

In [4]:
# create connection string using credentials
connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/sakila"

In [5]:
# create engine
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [6]:
# Load libraies for database creation
from sqlalchemy_utils import create_database, database_exists

if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [7]:
df_u = pd.read_csv('data/users.csv')
df_u.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
# upload books, authors and faves
# Now load the other 3 csv files
df_b = pd.read_csv('data/books.csv')
df_a = pd.read_csv('data/authors.csv')
df_f = pd.read_csv('data/faves.csv')

In [9]:
df_u.to_sql('users', engine, if_exists = 'replace')

3

In [10]:
df_b.to_sql('books', engine, if_exists = 'replace')

6

In [11]:
df_a.to_sql('author', engine, if_exists = 'replace')

5

In [12]:
df_f.to_sql('faves', engine, if_exists = 'replace')

7

In [13]:
# test query to complete assignment
q = """
SELECT *
FROM faves
"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [14]:
q = """
SELECT author_name
FROM author
"""
pd.read_sql(q, engine)

         author_name
0       Stephen King
1  F.Scott Fitgerald
2        Jack London
3        Jane Austen
4       Mary Shelley

In [15]:
q = """
SELECT author.author_name, books.title
FROM author
JOIN books ON author.id = books.author_id
"""
pd.read_sql(q, engine)

         author_name                 title
0       Stephen King           The Shining
1       Stephen King                    It
2  F.Scott Fitgerald      The Great Gatsby
3        Jack London  The Call of the Wild
4        Jane Austen   Pride and Prejudice
5       Mary Shelley          Frankenstein

In [18]:
# And now, let's list John Doe's favorit books
q = """
SELECT users.first_name, users.last_name, books.title
FROM users
JOIN faves ON users.id = faves.user_id
JOIN books ON faves.book_id = books.id
WHERE users.first_name = "John" AND users.last_name = "Doe"
"""
pd.read_sql(q, engine)

  first_name last_name             title
0       John       Doe       The Shining
1       John       Doe                It
2       John       Doe  The Great Gatsby